engineer-ae3o/stm32-hal-library/components/drivers/src/adc.c
        // Clear the TE flag. The DMA_HIFCR and DMA_LIFCR are write 1 to clear
        *irq_clear_register |= te_mask;

        if (te_local_cb) {
            te_local_cb(user_data, is_buf_1, num_of_items_left);
        }
    }

    if (*irq_status_register & dme_mask) {
        // Direct mode error. End the conversion and invoke the user callback.
        ASSERT(adc_regular_group_cont_end_conv(handle) == HAL_OK);

        // Clear the DME flag. The DMA_HIFCR and DMA_LIFCR are write 1 to clear
        *irq_clear_register |= dme_mask;

        if (dme_local_cb) {
            dme_local_cb(user_data, is_buf_1, num_of_items_left);
        }
    }
}

static inline void clear_state(ADC_TypeDef* handle, bool regular, bool injected) {
    if (regular) {
        handle->SR &= ~(ADC_SR_EOC | ADC_SR_STRT | ADC_SR_OVR);
        handle->CR1 &= ~(ADC_CR1_DISCEN | ADC_CR1_EOCIE | ADC_CR1_DISCNUM | ADC_CR1_OVRIE);
        handle->CR2 &= ~(ADC_CR2_CONT | ADC_CR2_EXTEN | ADC_CR2_DMA | ADC_CR2_SWSTART | ADC_CR2_EXTSEL | ADC_CR2_EOCS | ADC_CR2_DDS);
        handle->SQR1 &= ~(ADC_SQR1_L | ADC_SQR1_SQ13 | ADC_SQR1_SQ14 | ADC_SQR1_SQ15 | ADC_SQR1_SQ16);
        handle->SQR2 &= ~(ADC_SQR2_SQ7 | ADC_SQR2_SQ8 | ADC_SQR2_SQ9 | ADC_SQR2_SQ10 | ADC_SQR2_SQ11 | ADC_SQR2_SQ12);
        handle->SQR3 &= ~(ADC_SQR3_SQ1 | ADC_SQR3_SQ2 | ADC_SQR3_SQ3 | ADC_SQR3_SQ4 | ADC_SQR3_SQ5 | ADC_SQR3_SQ6);
    }
    if (injected) {
        handle->SR &= ~(ADC_SR_JEOC | ADC_SR_JSTRT);
        handle->CR1 &= ~(ADC_CR1_JDISCEN | ADC_CR1_JEOCIE | ADC_CR1_JAUTO);
        handle->CR2 &= ~(ADC_CR2_JEXTEN | ADC_CR2_JSWSTART | ADC_CR2_JEXTSEL);
        handle->JSQR &= ~(ADC_JSQR_JL | ADC_JSQR_JSQ1 | ADC_JSQR_JSQ2 | ADC_JSQR_JSQ3 | ADC_JSQR_JSQ4);
        handle->JOFR1 &= ~ADC_JOFR1_JOFFSET1;
        handle->JOFR2 &= ~ADC_JOFR2_JOFFSET2;
        handle->JOFR3 &= ~ADC_JOFR3_JOFFSET3;
        handle->JOFR4 &= ~ADC_JOFR4_JOFFSET4;
    }
}

static inline uint16_t oneshot_regular_group(ADC_TypeDef* handle, adc_channels_t channel) {
    // Clear all stale state before proceeding
    clear_state(handle, true, false);

    // Set the number of channels to be converted
    // An L[3:0] value of 0b0000 means 1 channel/conversion, a value of 0b0011 means 4
    // conversions etc. Which is why 0b0000 is used despite the sampling being for 1 channel
    handle->SQR1 |= 0b0000U << ADC_SQR1_L_Pos;

    // Set the channel
    handle->SQR3 |= (uint32_t)channel << ADC_SQR3_SQ1_Pos;

    // Start the conversion, and set the EOCS bit so that the EOC bit is set after any regular conversion
    handle->CR2 |= (ADC_CR2_SWSTART | ADC_CR2_EOCS);

    // Poll till the conversion is complete. That is, till the EOC bit is set
    uint32_t timeout_cycles = TIMEOUT_CYCLES;
    while (!(handle->SR & ADC_SR_EOC) && --timeout_cycles);
    if (timeout_cycles == 0) {
        // The max value of the ADC is 2^12 - 1 (4095). It is
        // safe to use UINT16_MAX as an error sentinel value.
        return UINT16_MAX;
    }

    // Get the final result
    return (uint16_t)handle->DR & 0xFFFU;
}


// General ADC use
hal_err_t adcx_clk_enable(ADC_TypeDef* handle, bool enable) {
    if (enable) {
#if defined(ADC1)
        if (handle == ADC1) {
            RCC->APB2ENR |= RCC_APB2ENR_ADC1EN;
        }
#endif
#if defined(ADC2)
        else if (handle == ADC2) {
            RCC->APB2ENR |= RCC_APB2ENR_ADC2EN;
        }
#endif
#if defined(ADC3)
        else if (handle == ADC3) {
            RCC->APB2ENR |= RCC_APB2ENR_ADC3EN;
        }
#endif
        else {
            return HAL_ERR_INVALID_ARG;
        }
    } else {
#if defined(ADC1)
        if (handle == ADC1) {
            RCC->APB2ENR &= ~RCC_APB2ENR_ADC1EN;
        }
#endif
#if defined(ADC2)
        else if (handle == ADC2) {
            RCC->APB2ENR &= ~RCC_APB2ENR_ADC2EN;
        }
#endif
#if defined(ADC3)
        else if (handle == ADC3) {
            RCC->APB2ENR &= ~RCC_APB2ENR_ADC3EN;
        }
#endif
        else {
            return HAL_ERR_INVALID_ARG;
        }
    }

    __DSB();
    return HAL_OK;
}

hal_err_t adc_configure(ADC_TypeDef* handle, const adc_config_t* config) {
    if (config == NULL || handle == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    // Set the data register alignment
    if (config->alignment == ADC_RIGHT_ALIGN) {
        handle->CR2 &= ~ADC_CR2_ALIGN;
    } else if (config->alignment == ADC_LEFT_ALIGN) {
        handle->CR2 |= ADC_CR2_ALIGN;
    } else {
        return HAL_ERR_INVALID_ARG;
    }

    // Set the ADC resolution
    handle->CR1 &= ~ADC_CR1_RES;
    handle->CR1 |= ((uint32_t)config->resolution << ADC_CR1_RES_Pos);

    // Set the sampling cycles for all external channels
    // Clear all the bit positions first
    handle->SMPR1 &= ~(ADC_SMPR1_SMP10 | ADC_SMPR1_SMP11 | ADC_SMPR1_SMP12 | ADC_SMPR1_SMP13 | ADC_SMPR1_SMP14 | ADC_SMPR1_SMP15);
    handle->SMPR2 &= ~(ADC_SMPR2_SMP0 | ADC_SMPR2_SMP1 | ADC_SMPR2_SMP2 | ADC_SMPR2_SMP3 | ADC_SMPR2_SMP4 | ADC_SMPR2_SMP5 | ADC_SMPR2_SMP6 |
                       ADC_SMPR2_SMP7 | ADC_SMPR2_SMP8 | ADC_SMPR2_SMP9);

    const uint32_t time = config->sampling_cycles;

    // Apply the sample cycles to all external channels
    handle->SMPR1 |= ((time << ADC_SMPR1_SMP10_Pos) | (time << ADC_SMPR1_SMP11_Pos) | (time << ADC_SMPR1_SMP12_Pos) | (time << ADC_SMPR1_SMP13_Pos) |
                      (time << ADC_SMPR1_SMP14_Pos) | (time << ADC_SMPR1_SMP15_Pos));

    handle->SMPR2 |= ((time << ADC_SMPR2_SMP0_Pos) | (time << ADC_SMPR2_SMP1_Pos) | (time << ADC_SMPR2_SMP2_Pos) | (time << ADC_SMPR2_SMP3_Pos) |
                      (time << ADC_SMPR2_SMP4_Pos) | (time << ADC_SMPR2_SMP5_Pos) | (time << ADC_SMPR2_SMP6_Pos) | (time << ADC_SMPR2_SMP7_Pos) |
                      (time << ADC_SMPR2_SMP8_Pos) | (time << ADC_SMPR2_SMP9_Pos));

    return HAL_OK;
}

hal_err_t adc_power_on(ADC_TypeDef* handle, bool on) {
    if (handle == NULL) {
        return HAL_ERR_INVALID_ARG;
    }
    if (on) {
        handle->CR2 |= ADC_CR2_ADON;
        delay_us(ADC_STARUP_TIME_US);
    } else {
        handle->CR2 &= ~ADC_CR2_ADON;
    }
    return HAL_OK;
}


